# ------------------------------------------
# build tools
# ------------------------------------------
brew "gcc"
brew "make"
brew "cmake"
brew "llvm"

# ------------------------------------------
# shell
# ------------------------------------------
brew "zsh"

# ------------------------------------------
# editor
# ------------------------------------------
brew "emacs"
brew "vim"
brew "neovim"

# ------------------------------------------
# langauge
# ------------------------------------------
brew "python"
brew "python@3.8"
brew "python@3.7"
brew "ruby"
brew "perl"
brew "go"

brew "rustup-init"
brew "haskell-stack"

brew "cling"

brew "anyenv"

brew "pipenv"
brew "poetry"

# ------------------------------------------
# C library
# ------------------------------------------
brew "libssh"
brew "libomp"
brew "boost"

# ------------------------------------------
# compressor
# ------------------------------------------
brew "gzip"
brew "xz"

# ------------------------------------------
# misc
# ------------------------------------------
brew "binutils"     # GNU binary tools
brew "coreutils"    # GNU core utilities
brew "findutils"    # GNU find, locate, and xargs
brew "openssl"      # OpenSSL
brew "git"          # revision control system
brew "git-lfs"      # Git extension for versioning large files
brew "gh"           # Github CLI
brew "git-delta"    # syntax-highlighting pager
brew "docker"       # platform for developing apps
brew "tmux"         # terminal multiplexer
brew "wget"         # internet file retriever
brew "curl"         # internet file retriever
brew "htop"         # improved top
brew "bat"          # improved cat
brew "fd"           # improved find
brew "exa"          # improved ls
brew "ripgrep"      # improved grep
brew "procs"        # improved ps
brew "dust"         # improved du
brew "broot"        # improved tree
brew "colordiff"    # colored diff
brew "fzf"          # interactive filtering tool
brew "tree"         # recursive directory listing command
brew "watch"        # execute a program periodically
brew "tokei"        # display statistics about code
brew "graphviz"     # graph visualization software
brew "st"           # terminal emulator
brew "nkf"          # kanji code converter
brew "jq"           # command-line JSON processor
brew "xsv"          # command-line CSV processor
brew "imagemagick"  # image manipulator
brew "parallel"     # Command parallelization utility
brew "black"        # Python code formatter
brew "flake8"       # Python code checker
brew "isort"        # Python import optimizer
brew "pre-commit"   # pre-commit hook manager
brew "silicon"      # source code image creator
brew "tldr"         # collection of help pages
brew "hyperfine"    # benchmarking tool
brew "jump"         # directory navigator
brew "sphinx-doc"   # document generator

# ------------------------------------------
# GUI macOS applications
# ------------------------------------------
tap "homebrew/cask"

# input
cask "google-japanese-ime"

# browser
cask "google-chrome"
cask "firefox"
cask "microsoft-edge"

# development tool
cask "iterm2"
cask "visual-studio-code"
cask "pycharm"
cask "webstorm"
cask "docker"
cask "mactex"

# note
cask "notion"
cask "evernote"

# communication
cask "zoom"
cask "discord"
cask "skype"
cask "slack"
mas "LINE", id: 539883307

# misc
cask "adobe-acrobat-reader"
cask "alfred"
cask "clipy"
cask "grammarly"
cask "mendeley"
cask "papers"
cask "kindle"
cask "flux"
cask "kap"
mas "Effortless", id: 1368722917
mas "Craft", id: 1487937127

# ------------------------------------------
# Fonts
# ------------------------------------------
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"
