# ------------------------------------------
# build tools
# ------------------------------------------
brew "gcc"
brew "make"
brew "cmake"

# ------------------------------------------
# shell
# ------------------------------------------
brew "zsh"

# ------------------------------------------
# editor
# ------------------------------------------
brew "emacs"
brew "vim"

# ------------------------------------------
# langauge
# ------------------------------------------
brew "python", link: false
brew "python@3.8", link: true
brew "ruby"
brew "perl"
brew "go"
brew "rust"
brew "haskell-stack"

brew "cling"

brew "anyenv"

# ------------------------------------------
# C library
# ------------------------------------------
brew "libssh"

# ------------------------------------------
# compressor
# ------------------------------------------
brew "gzip"
brew "xz"

# ------------------------------------------
# misc
# ------------------------------------------
brew "git"          # revision control system
brew "gh"           # Github CLI
brew "git-delta"    # syntax-highlighting pager
brew "docker"       # platform for developing apps
brew "tmux"         # terminal multiplexer
brew "wget"         # internet file retriever
brew "curl"         # internet file retriever
brew "htop"         # improved top
brew "bat"          # improved cat
brew "fd"           # improved find
brew "exa"          # improved ls
brew "ripgrep"      # improved grep
brew "procs"        # improved ps
brew "colordiff"    # colored diff
brew "fzf"          # interactive filtering tool
brew "tree"         # recursive directory listing command
brew "watch"        # execute a program periodically
brew "tokei"        # display statistics about code
brew "graphviz"     # graph visualization software
brew "st"           # terminal emulator
brew "nkf"          # kanji code converter
brew "jq"           # command-line JSON processor
brew "xsv"          # command-line CSV processor
brew "imagemagick"  # image manipulator

# ------------------------------------------
# GUI macOS applications
# ------------------------------------------
tap "homebrew/cask"

# input
cask "google-japanese-ime"

# browser
cask "google-chrome"

# development tool
cask "iterm2"
cask "visual-studio-code"
cask "pycharm"
cask "webstorm"
cask "docker"
cask "mactex"

# note
cask "notion"
cask "evernote"

# communication
cask "zoom"
cask "discord"
cask "skype"
cask "slack"
mas "LINE", id: 539883307

# misc
cask "alfred"
cask "clipy"
cask "grammarly"
cask "mendeley"
cask "kindle"
mas "Effortless", id: 1368722917
