# ------------------------------------------
# Build tools
# ------------------------------------------
brew "autoconf"
brew "automake"
brew "cmake"
brew "gcc", args: ["force-bottle"]
brew "gcc@11"
brew "llvm"
brew "make"
brew "openjdk@11"

# ------------------------------------------
# Shell
# ------------------------------------------
brew "zsh"

# ------------------------------------------
# Editor
# ------------------------------------------
brew "emacs"
brew "vim"

# ------------------------------------------
# Programming languages
# ------------------------------------------
brew "anyenv"
brew "chruby"
brew "cling"
brew "go"
brew "haskell-stack"
brew "perl"
brew "python"
brew "r"
brew "ruby", args: ["force-bottle"]
brew "ruby-install"
brew "rustup-init"

# ------------------------------------------
# Python tooling
# ------------------------------------------
brew "uv"
brew "poetry"
brew "pipenv"
brew "pipx"         # Execute binaries from Python packages in isolated environments

# ------------------------------------------
# C library
# ------------------------------------------
brew "boost"
brew "libomp"
brew "libssh"
brew "libtool"

# ------------------------------------------
# Compressor
# ------------------------------------------
brew "gzip"
brew "xz"

# ------------------------------------------
# CLI utilities
# ------------------------------------------
brew "bat"          # improved cat
brew "binutils"     # GNU binary tools
brew "colordiff"    # colored diff
brew "coreutils"    # GNU core utilities
brew "curl"         # internet file retriever
brew "eza"          # improved ls
brew "findutils"    # GNU find, locate, and xargs
brew "fzf"          # interactive filtering tool
brew "gh"           # Github CLI
brew "git"          # revision control system
brew "git-delta"    # syntax-highlighting pager
brew "git-lfs"      # Git extension for versioning large files
brew "htop"         # improved top
brew "imagemagick"  # image manipulator
brew "jq"           # command-line JSON processor
brew "mackup"       # sync Mac's application settings
brew "nkf"          # kanji code converter
brew "openblas"     # OpenBLAS
brew "openssl"      # OpenSSL
brew "parallel"     # command parallelization utility
brew "ripgrep"      # improved grep
brew "subversion"   # revision control system
brew "tmux"         # terminal multiplexer
brew "tokei"        # display statistics about code
brew "tree"         # recursive directory listing command
brew "watch"        # execute a program periodically
brew "wget"         # internet file retriever

# ------------------------------------------
# GUI macOS applications
# ------------------------------------------
# Browser
cask "google-chrome"

# Communication
cask "discord"
mas "LINE", id: 539883307
cask "slack"
cask "zoom"

# Development tool
cask "codex"
cask "docker-desktop"
cask "gcloud-cli"
cask "iterm2"
cask "visual-studio-code"

# Input
cask "google-japanese-ime"

# Misc
cask "adobe-acrobat-reader"
cask "alfred"
cask "clipy"
cask "dropbox"
mas "Effortless", id: 1368722917
mas "Keynote", id: 409183694
cask "kindle"
cask "microsoft-office"

# Note
mas "Craft", id: 1487937127
cask "notion"
