brew "starship"

brew "uv"
brew "poetry"
brew "pipenv"
brew "pipx"

brew "bat"
brew "eza"
brew "ripgrep"

brew "fzf"
brew "jq"
brew "parallel"

brew "git-delta"
brew "git-lfs"

cask "codex"

if OS.mac?
  brew "gcc"
  brew "make"
  
  brew "zsh"

  brew "emacs"
  brew "vim"

  brew "python"
  brew "rustup-init"

  brew "gzip"
  brew "xz"

  brew "git"
  brew "coreutils"
  brew "mackup"

  cask "google-chrome"

  cask "discord"
  cask "slack"
  cask "zoom"
  mas "LINE", id: 539883307

  cask "docker-desktop"
  cask "gcloud-cli"
  cask "iterm2"
  cask "visual-studio-code"

  cask "google-japanese-ime"

  cask "adobe-acrobat-reader"
  cask "alfred"
  cask "clipy"
  cask "dropbox"
  cask "kindle"
  cask "microsoft-office"
  mas "Effortless", id: 1368722917
  mas "Keynote", id: 409183694

  cask "notion"  
  mas "Craft", id: 1487937127
end
