# build tools
brew "gcc"
brew "make"
brew "cmake"

# shell
brew "zsh"

# Editor
brew "emacs"
brew "vim"

# langauge
brew "python", link: false
brew "python@3.8", link: true
brew "ruby"
brew "perl"
brew "go"
brew "rust"

brew "cling"

brew "anyenv"

# C library
brew "libssh"

# Compressor
brew "gzip"
brew "xz"

# misc
brew "git"       # revision control system
brew "tmux"      # terminal multiplexer
brew "wget"      # internet file retriever
brew "curl"      # internet file retriever
brew "htop"      # improved top
brew "ripgrep"   # improved grep
brew "procs"     # improved ps
brew "peco"      # interactive filtering tool
brew "tree"      # recursive directory listing command
brew "watch"     # execute a program periodically
brew "tokei"     # display statistics about code
brew "graphviz"  # graph visualization software
brew "st"        # terminal emulator
brew "nkf"       # kanji code converter
brew "jq"        # command-line JSON processor
brew "xsv"       # command-line CSV processor
